[
  {
    "category": "nlp",
    "authors": "Ahmed, K. · Islam, N. · Sen, R. · Roy, D.",
    "dataset": "#",
    "badge": "LREC-COLING",
    "title": "Bāko Corpus 2.0: A 5-Billion Token Web Corpus for Bengali",
    "pdf": "#",
    "body": "After two years of crawling, cleaning, and de-duplicating, we are releasing BākoCorpus 2.0 — the largest open Bengali text corpus ever published. This paper describes our pipeline for quality filtering and deduplication.",
    "tags": "",
    "year": "2024"
  },
  {
    "category": "morphology",
    "authors": "Ghosh, I. · Paul, S.",
    "badge": "Computational Linguistics",
    "title": "Morphological Inflection in Agglutinative Languages: Lessons from Bengali",
    "pdf": "#",
    "body": "This study provides a formal computational account of Bengali's rich morphological system—agglutinative verb forms, honorific scales, and nominal declension.",
    "tags": "",
    "year": "2024"
  },
  {
    "category": "nlp",
    "authors": "Chakraborty, M. · Tamang, S. · Islam, F.",
    "badge": "EMNLP 2024",
    "code": "#",
    "title": "Low-Resource Neural Machine Translation: Bengali↔Tibetan",
    "pdf": "#",
    "body": "How we constructed a 52,000-sentence parallel corpus for one of the world's most challenging language pairs — and what it reveals about the limits of transfer learning from large multilingual models.",
    "tags": "",
    "year": "2024"
  },
  {
    "category": "nlp",
    "authors": "Rahman, M. · Hossain, T. · Chowdhury, S. · Islam, N. · Sen, R. · Ahmed, K. · Das, P.",
    "dataset": "#",
    "badge": "ACL 2025",
    "code": "#",
    "title": "BengaliQA: A Large-Scale Open-Domain Question Answering Benchmark",
    "pdf": "#",
    "body": "We introduce BengaliQA, a 50,000-question benchmark for open-domain QA in Bengali, covering 12 domains. We evaluate 8 multilingual models and find significant performance gaps compared to English benchmarks, motivating Bengali-native LLMs.",
    "tags": "",
    "year": "2025"
  },
  {
    "category": "speech",
    "authors": "Das, P. · Biswas, A.",
    "dataset": "#",
    "badge": "Journal of Phonetics",
    "title": "Tonal Variation in Chittagonian: A Computational Phonological Analysis",
    "pdf": "#",
    "body": "Chittagonian Bengali exhibits tonal distinctions absent from Standard Bengali. We present the first large-scale acoustic corpus study of 1,200 minimal pairs and develop a computational model of tonal phonology using autosegmental representation.",
    "tags": "",
    "year": "2025"
  }
]
