[
  {
    "order": "05",
    "projects": "",
    "link": "../publications/?filter=dialectology",
    "tools": "",
    "title": "Dialect Documentation",
    "body": "Standard Bengali (Shuddhô Bhasha) dominates existing NLP research, leaving millions of speakers of Sylheti, Chittagonian, Rajshahi, Mymensingh, and Rangpur dialects invisible to language technology. We conduct fieldwork, build corpora, and develop computational tools for these underrepresented varieties — several of which face serious endangerment.",
    "char": "ড",
    "tag": "Dialectology"
  },
  {
    "order": "06",
    "projects": "",
    "link": "../publications/?filter=edtech",
    "tools": "",
    "title": "Language Learning Technology",
    "body": "We design AI-powered tools for heritage learners, diaspora communities, and literacy programs in under-resourced Bengali-medium schools. Our tools include adaptive grammar exercises, an intelligent writing assistant, and a speaking practice companion — all built with learner-centered design principles.",
    "char": "শি",
    "tag": "EdTech · Tools"
  },
  {
    "order": "03",
    "projects": "",
    "link": "../publications/?filter=morphology",
    "tools": "",
    "title": "Morphology & Grammar",
    "body": "Bengali is an agglutinative language with a remarkably complex verb morphology — a single verb form can encode tense, aspect, mood, person, number, and politeness simultaneously. We develop formal computational grammars, morphological analyzers, and syntactic parsers that faithfully represent this complexity.",
    "char": "গ",
    "tag": "Computational Linguistics"
  },
  {
    "order": "01",
    "projects": "",
    "link": "../publications/?filter=nlp",
    "tools": "",
    "title": "Natural Language Processing",
    "body": "We build foundational NLP infrastructure trained natively on Bengali — not adapted from English models. Our work includes large language models, token classification, dependency parsing, and coreference resolution that capture Bengali's unique morphosyntactic properties.",
    "char": "অ",
    "tag": "NLP · AI"
  },
  {
    "order": "02",
    "projects": "",
    "link": "../publications/?filter=speech",
    "tools": "",
    "title": "Speech & Phonology",
    "body": "Bengali's phonological system — with its aspirated stops, inherent vowel patterns, and sandhi rules — presents unique challenges and opportunities for speech technology. We develop ASR, TTS, and acoustic models that capture the full prosodic and tonal range of spoken Bengali across registers and dialects.",
    "char": "শ",
    "tag": "Phonetics · Speech"
  },
  {
    "order": "04",
    "projects": "",
    "link": "../publications/?filter=translation",
    "tools": "",
    "title": "Cross-Lingual Systems",
    "body": "We develop neural machine translation systems for Bengali paired with low-resource languages — a critical gap given that the majority of MT research focuses on English-centric pairs. Our work covers Bengali↔Hindi, Bengali↔Tibetan, Bengali↔Sylheti, and other South and Southeast Asian pairs.",
    "char": "ব",
    "tag": "Machine Translation"
  }
]
